[
  {
    "id": 1,
    "name": "Simon Belmont",
    "age": 22,
    "info": {
      "theme": "Simon's Theme",
      "main-weapons": ["Vampire Killer (base)","Vampire Killer (chain)","Vampire Killer (flail)"],
      "sub-weapons": ["Holy water","Dagger","Cross","Stopwatch","Axe"],
      "dracula-defeats": 2,
      "canon-appearances": ["Castlevania","Castlevania II: Simon's Quest"]
    },
    "description": "Most famous of the Belmonts, Simon was a man of few words and even less tolerance of the night.  Not only did he storm Dracula's castle by himself and take down the vampire's one-on-one, but he also trekked across Wallachia years later to gather Dracula's scattered remains, bringing him back to life. Why? So he could beat Dracula AGAIN...and eliminate the vampire's lingering curse at the same time.",
    "badassness": 4,
    "image": {
      "small": "img/simon.jpg",
      "large": "img/simon.jpg"
    }
  },
  {
    "id": 2,
    "name": "Trevor Belmont",
    "age": 23,
    "info": {
      "theme": "Beginning",
      "main-weapons": ["Vampire Killer (base)","Vampire Killer (chain)","Vampire Killer (flail)"],
      "sub-weapons": ["Holy water","Dagger","Cross","Axe"],
      "dracula-defeats": 1,
      "canon-appearances": ["Castlevania III: Dracula's Curse","Castlevania: Curse of Darkness"]
    },
    "description": "Trevor Belmont was labeled a misfit by Wallachia's citizens along with the rest of the Belmont clan, due to rumors of witchcraft and malevolent supernatural forces the citizenry didn't comprehend. That didn't stop Trevor from teaming up with Dracula's son Alucard, a reclusive witch named Sypha Belnades, and a thief named Grant Danasty to take down the Lord of Darkness.  Three years later Trevor assisted Dracula's former Devil Forgemaster, Hector, in freeing Wallachia of Dracula and his curse, as the curse had lingered and given life to the fiend once more.",
    "badassness": 4,
    "image": {
      "small": "img/trevor.jpg",
      "large": "img/trevor.jpg"
    }
  },
  {
    "id": 3,
    "name": "Leon Belmont",
    "age": 22,
    "info": {
      "theme": "Lament of Innocence ~Leon's Theme~",
      "main-weapons": ["Whip of Alchemy","Vampire Killer (base)"],
      "sub-weapons": ["Holy water","Crystal","Cross","Dagger","Axe"],
      "dracula-defeats": 0,
      "canon-appearances": "Castlevania: Lament of Innocence"
    },
    "description": "Leon Belmont and Mathias Cronqvist were elite knights of the church...until Mathias lost his wife Elisabetha to disease.  Enraged, Mathias deceived Leon and siezed the powers of vampire Walter Bernhard (and his castle, no less) to rebel against God for taking his wife, becoming the notorious Dracula. Leon had no choice but to create the Vampire Killer - from his Whip of Alchemy and the soul of his betrothed, Sara - to gain strength that would harm Dracula and his servants. Leon swore that from that point on the Belmont clan would \"hunt [Dracula], AND the night!\"",
    "badassness": 4,
    "image": {
      "small": "img/leon.jpg",
      "large": "img/leon.jpg"
    }
  },
  {
    "id": 4,
    "name": "Christopher Belmont",
    "age": "Unknown",
    "info": {
      "theme": ["Battle of the Holy","New Messiah"],
      "main-weapons": ["Vampire Killer (base)","Vampire Killer (flail)","Vampire Killer (fireball)"],
      "sub-weapons": ["Holy water","Axe","Cross"],
      "dracula-defeats": 2,
      "canon-appearances": ["Castlevania: The Adventure","Castlevania II: Belmont's Revenge"]
    },
    "description": "Christopher Belmont rose up to put Dracula back in his place, as the Belmonts do, once the fiend woke from his centennial slumber in 1576. In fact, Christopher laid such a beating on Dracula that he was reduced to an escaping cloud of mist!  15 years later, Christopher's son Soleiyu finished his rite of passage into manhood, and all seemed well.  However, a still-weakened Dracula took the boy to his castle! Christopher had to fight through four elemental castles to raise Dracula's from the depths, rescue his son, and finish what he started 15 years prior.",
    "badassness": 4,
    "image": {
      "small": "img/christopher.jpg",
      "large": "img/christopher.jpg"
    }
  },
  {
    "id": 5,
    "name": "Adrian Farenheit Tepes (Alucard)",
    "age": "Immortal (appears 18)",
    "info": {
      "theme": ["Dracula's Castle","The Tragic Prince"],
      "main-weapons": "Medieval Armaments",
      "sub-weapons": ["Holy water","Cross","Axe","Dagger","Stopwatch"],
      "dracula-defeats": 1,
      "canon-appearances": ["Castlevania III: Dracula's Curse","Castlevania: Symphony of the Night","Castlevania: Nocturne of Recollection (radio drama)","Castlevania: Aria of Sorrow","Castlevania: Dawn of Sorrow"]
    },
    "description": "Adrian Farenheit Tepes took the name Alucard after witnessing his father declare war on humanity. His campaign against Dracula led him to ally with Trevor Belmont's party in 1476, as well as Richter Belmont hundreds of years later. Alucard took Maria Renard as his ward after Dracula's defeat by Richter in 1797, defending her from an incubus a year later. In 2035 and 2036 Alucard was challenged by what seemed to be his final adversaries: forces hellbent on making the reincarnation of Dracula (Soma Cruz) become a vessel for his resurrection, after the fiend was finally obliterated by Julius Belmont in the Battle of 1999.  Alucard, Julius, Soma, and Sypha Belnades's descendant Yoko thwarted both plans as they unfurled.",
    "badassness": 4,
    "image": {
      "small": "img/alucard.jpg",
      "large": "img/alucard.jpg"
    }
  },
  {
    "id": 6,
    "name": "Maria Renard",
    "age": "18 (last appearance)",
    "info": {
      "theme": "Guardian",
      "main-weapons": ["Guardian spirits","Animal dominion","Fisticuffs"],
      "sub-weapons": ["Guardian's Knuckle","Songbook"],
      "dracula-defeats": 0,
      "canon-appearances": ["Castlevania: Rondo of Blood","Castlevania: Symphony of the Night","Castlevania: Nocturne of Recollection (radio drama)"]
    },
    "description": "Maria Renard was 12 years old when she first started hunting the night.  Wielding nothing but her dominion over animals and guardian spirits, Maria fought the darkness but was eventually captured.  Richter Belmont rescued her once he slayed Dracula in 1792. Five years later Richter disappeared, prompting Maria to seek him out.  She found him in Dracula's revived castle, deluded by a dark spell and in combat with Alucard.  Maria developed a strong attraction to Alucard and, following Dracula's defeat at Alucard's hand, convinced him to let her move in.  Good that she did, as he defended her from a devious incubus in the following year.",
    "badassness": 3,
    "image": {
      "small": "img/maria.jpg",
      "large": "img/maria.jpg"
    }
  },
  {
    "id": 7,
    "name": "Richter Belmont",
    "age": "25 (last appearance)",
    "info": {
      "theme": ["Overture","Blood Relations"],
      "main-weapons": ["Vampire Killer (base)","Vampire Killer (chain)","Vampire Killer (flail)"],
      "sub-weapons": ["Holy water","Dagger","Cross","Stopwatch","Axe"],
      "dracula-defeats": 1,
      "canon-appearances": ["Castlevania: Rondo of Blood","Castlevania: Symphony of the Night","Castlevania: Nocturne of Recollection (radio drama)"]
    },
    "description": "Richter Belmont took up the Belmont mantle and slayed Dracula as his destiny dictated.  He rescued Maria Renard from Dracula's clutches, and after five years went to the castle again under the spell of a dark priest named Shaft.  Dracula's son Alucard snapped him out of it, allowing he and Maria to escape while Alucard finished the fight in the reversed castle that appeared.  A year later, Richter once again came to Maria's rescue, for she had been stalked and rendered unconscious by servants of the incubus Magnus.",
    "badassness": 4,
    "image": {
      "small": "img/richter.jpg",
      "large": "img/richter.jpg"
    }
  },
  {
    "id": 8,
    "name": "Julius Belmont",
    "age": "57 (last appearance)",
    "info": {
      "theme": "Can't Wait Until the Night",
      "main-weapons": "Vampire Killer (flail)",
      "sub-weapons": ["Axe","Holy water","Cross","Grand Cross"],
      "dracula-defeats": 1,
      "canon-appearances": ["Castlevania: Aria of Sorrow","Castlevania: Dawn of Sorrow","Castlevania: Ricordanza of the God Abyss (novel)"]
    },
    "description": "Julius Belmont was the leader of a final, decisive campaign against Dracula known as the Demon Castle War, culminating in the Battle of 1999 and the true obliteration of Dracula. The vampire's castle was sealed by Julius in a solar eclipse along with the Vampire Killer, an act which erased many of Julius's memories.  In 2035 Julius's memories were awakened once again after he, along with Alucard, needed to venture into the eclipse and help prevent Dracula's reincarnation Soma Cruz from becoming Dracula himself.  A cult rose to power in the following year, with the goal of bringing forth Dracula's power and using Soma as its vessel; Julius, Alucard, and Sypha Belnades's descendant Yoko assisted Soma in thwarting the cult's plans. One year later, Julius and his constituents rose to the challenge of defeating Olrox, one of Dracula's old generals and mastermind of a siniter plan to conquer the living and chaos realms.",
    "badassness": 5,
    "image": {
      "small": "img/julius.jpg",
      "large": "img/julius.jpg"
    }
  }
]